IDENTIFICATION DIVISION.
PROGRAM-ID. RANDOM-MESSAGE.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  RANDOM-NUMBER PIC 99.
01  MESSAGE PIC X(50).

PROCEDURE DIVISION.
    DISPLAY "Generating a random number..."
    CALL "RANDOMIZER" USING RANDOM-NUMBER
    DISPLAY "You have " RANDOM-NUMBER " bitches"
    STOP RUN.

PROGRAM-ID. RANDOMIZER.
DATA DIVISION.
WORKING-STORAGE SECTION.
01  NUMBER-OUT PIC 99.

PROCEDURE DIVISION USING NUMBER-OUT.
    MOVE FUNCTION RANDOM(8) TO NUMBER-OUT.
    EXIT PROGRAM.
